using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace BPMPlus.Data.Migrations
{
    /// <inheritdoc />
    public partial class InjectDb2 : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql($@"
                INSERT INTO PermissionGroup (PermissionGroupId,PermissionGroupName,CreatedTime,UpdatedTime) VALUES
                ('G0010',N'專案管理員','2024-09-16','2024-09-16');
                GO
                INSERT INTO Project (ProjectId,ProjectManagerId, ProjectName, Summary, DeadLine, CreatedTime, UpdatedTime) VALUES
                    ('P001', 'A001',N'104人力銀行', N'這是項目 1 的摘要資訊', '2024-12-31', '2024-01-01', '2024-08-28'),
                    ('P002', 'A001',N'雲雀國際', N'這是項目 2 的摘要資訊', '2024-11-30', '2024-01-02', '2024-08-27'),
                    ('P003','A002', N'華碩網頁', N'這是項目 3 的摘要資訊', '2024-10-31', '2024-01-03', '2024-08-26'),
                    ('P004','A002',N'麗寶營造', N'這是項目 4 的摘要資訊', '2024-09-30', '2024-01-04', '2024-08-25'),
                    ('P005', 'A003',N'經晨行銷', N'這是項目 5 的摘要資訊', '2024-08-31', '2024-01-05', '2024-08-24'),
                    ('P006','A003', N'Tibame', N'這是項目 6 的摘要資訊', '2024-07-31', '2024-01-06', '2024-08-23'),
                    ('P007','A004', N'捷運登入', N'這是項目 7 的摘要資訊', '2024-06-30', '2024-01-07', '2024-08-22'),
                    ('P008','A004', N'Ubike帳戶', N'這是項目 8 的摘要資訊', '2024-05-31', '2024-01-08', '2024-08-21'),
                    ('P009', 'A005',N'中信銀行外部網站', N'這是項目 9 的摘要資訊', '2024-04-30', '2024-01-09', '2024-08-20'),
                    ('P010', 'A005',N'第一銀行內網', N'這是項目 10 的摘要資訊', '2024-03-31', '2024-01-10', '2024-08-19');
                GO
                INSERT INTO Users (DepartmentId, UserId, GradeId, UserIsActive, CreatedTime, UpdatedTime, TEL, UserName, Email, Password) VALUES
                ('D001', 'A001', '01', 1, '2024-08-01', '2024-08-01', '0912345678', N'王小明(Admin)', 'tim102@tim.com', '$2b$10$5Gix0lXUXZ.NoDqXx6VtOuBWJQBb/dwXjNHwc8CNlxQ.VlEBXmIji'),
                ('D002', 'A002', '02', 1, '2024-08-02', '2024-08-02', '0922334455', N'李小華', 'lihua@domain.com', '$2b$10$TerkGwFIc4vMrzWEie5gzOgNjWtr4MTFD2Qvgu3PUHbSBakgu3AjG'),
                ('D003', 'A003', '03', 1, '2024-08-03', '2024-08-03', '0933445566', N'陳大文', 'dawen@domain.com', '$2b$10$a0P.SVqYtRkw44VVSQDn2OfjMaxKIdOF9d.WbsEIDFVb1EJRTiE1u'),
                ('D004', 'A004', '04', 1, '2024-08-04', '2024-08-04', '0944556677', N'趙小美', 'zhaomei@domain.com', '$2b$10$M.rODlSADLdFLdVlmd2oPezcZ0qVO8fX8Q7GwuxtZCnZvK6DDstA.'),
                ('D005', 'A005', '05', 1, '2024-08-05', '2024-08-05', '0955667788', N'劉小強', 'xiaoqiang@domain.com', '$2b$10$rBm.L1REKMIOYGKVWra/t.NaT1kBtzPzMPFCpXoOdMSfSJtV7qpqy'),
                ('D006', 'A006', '06', 1, '2024-08-06', '2024-08-06', '0966778899', N'鄭小麗', 'xiaoli@domain.com', '$2b$10$NJ42DN/qMq8gZRKpmfHZtuKELwNyi4t0IXl9McwTywJXIrbNgdO7K'),
                ('D007', 'A007', '07', 1, '2024-08-07', '2024-08-07', '0977889900', N'吳小明', 'xiaoming@domain.com', '$2b$10$TCzR2Na.ReKrAcrS99sYxuFjvx9GmFeotwcfuP2NSmAlupwwkc7wi'),
                ('D008', 'A008', '08', 1, '2024-08-08', '2024-08-08', '0988990011', N'林小華', 'linhua@domain.com', '$2b$10$tjstqLk0Z1Ua/TJ/7WRSp.dq1l3ca2yseZv35fUVAGloHuJ0VCkjy'),
                ('D001', 'A009', '09', 1, '2024-08-09', '2024-08-09', '0922345567', N'張大文', 'dawen2@domain.com', '$2b$10$SMCWgjVLxgM2HUe0iAhcuOVtlnqYfvtDsQZCA0ZxzeJkOzWFSBAaS'),
                ('D002', 'A010', '10', 1, '2024-08-10', '2024-08-10', '0934456678', N'黃小美', 'zhaomei2@domain.com', '$2b$10$Dc8ggWvs95ZtilMyBb.q8uK8O1TNxR9gzofXMQ5reU6Eyu18lNlNG'),
                ('D003', 'A011', '01', 1, '2024-08-11', '2024-08-11', '0945567789', N'李小明', 'xiaoming2@domain.com', '$2b$10$sNX9mLIvwyZ2KOVDJkaFOeXFO0LDxxqRM9Qn4RyzaSz3I95vgUpla'),
                ('D004', 'A012', '02', 1, '2024-08-12', '2024-08-12', '0956678890', N'王小麗', 'xiaoli2@domain.com', '$2b$10$1uX0JZ1Vs33RywSNvmqdGu2LrbjQHTqZslqDidXtvCeN81rDPeFhC'),
                ('D005', 'A013', '03', 1, '2024-08-13', '2024-08-13', '0967789901', N'陳小強', 'xiaoqiang2@domain.com', '$2b$10$VXiavqCEdJMTRG4taadJV.PjAd6GCvQj5wAutNM9iUn/6LIbrqdLq'),
                ('D006', 'A014', '04', 1, '2024-08-14', '2024-08-14', '0978890012', N'趙小華', 'zhaohua@domain.com', '$2b$10$opY3XssND0UtbIrKeSp7k.4WmJzJX9r0trCBlDtkZoJ5o141K9DI6'),
                ('D007', 'A015', '05', 1, '2024-08-15', '2024-08-15', '0989901123', N'劉大文', 'dawen3@domain.com', '$2b$10$lojOJJT8FWBLeUa0g1ukH.E3gTJuyNtS0YbkDqigqsGdopp08jRNe'),
                ('D008', 'A016', '06', 1, '2024-08-16', '2024-08-16', '0911012234', N'林小麗', 'xiaoli3@domain.com', '$2b$10$FemEH7a1WJeNTg/nWVNOVOzQjDASdAV5/DfaLBt5DDp6OnaVHtTcO'),
                ('D001', 'A017', '07', 1, '2024-08-17', '2024-08-17', '0922123345', N'吳大文', 'dawen4@domain.com', '$2b$10$skNNQ9.VdVw9af6fXUogj.PibFuvSuEV3fuL.LXtuuf9hiHc38l3C'),
                ('D002', 'A018', '08', 1, '2024-08-18', '2024-08-18', '0933234456', N'黃小麗', 'xiaoli4@domain.com', '$2b$10$CKBEF8e6FvN83ene.hutAukeI1Ntm/4G8molBbHnMGm7hoh7nApWG'),
                ('D003', 'A019', '09', 1, '2024-08-19', '2024-08-19', '0944345567', N'張大文', 'dawen5@domain.com', '$2b$10$1BTZnYMyEyUx2YDaS0i.HOGNBh6cJxkVU2515tqZjv9b6bFVw3KKa'),
                ('D004', 'A020', '10', 1, '2024-08-20', '2024-08-20', '0955456678', N'李小強', 'xiaoqiang3@domain.com', '$2b$10$wN31.KYmeJtNhgoKIu4sE.Onqp9m6pcad041JZDR/Mj1wuXxy3eIe'),
                ('D002', 'A021', '05', 1, '2024-08-19', '2024-08-19', '0912345001', N'人資部管理員風間', 'dawen5@domain.com', '$2b$10$1BTZnYMyEyUx2YDaS0i.HOGNBh6cJxkVU2515tqZjv9b6bFVw3KKa'),
                ('D002', 'A022', '01', 1, '2024-08-19', '2024-08-19', '0912345002', N'人資部職員阿呆', 'dawen5@domain.com', '$2b$10$1BTZnYMyEyUx2YDaS0i.HOGNBh6cJxkVU2515tqZjv9b6bFVw3KKa'),
                ('D001', 'A023', '05', 1, '2024-08-19', '2024-08-19', '0912345003', N'資訊部管理員妮妮', 'dawen5@domain.com', '$2b$10$1BTZnYMyEyUx2YDaS0i.HOGNBh6cJxkVU2515tqZjv9b6bFVw3KKa');
                GO
                INSERT INTO ProjectUser (ProjectsProjectId, UsersUserId) VALUES
                ('P001', 'A001'),
                ('P001', 'A002'),
                ('P001', 'A003'),
                ('P002', 'A001'),
                ('P002', 'A006'),
                ('P002', 'A007'),
                ('P002', 'A008'),
                ('P003', 'A002'),
                ('P003', 'A010'),
                ('P003', 'A012'),
                ('P004', 'A002'),
                ('P005', 'A003'),
                ('P006', 'A003');
                GO
                INSERT INTO PermissionGroupUserActivity(PermissionGroupsPermissionGroupId, UserActivitiesUserActivityId) VALUES 
                ('G0009','09'),('G0008','08'),('G0006','03'),('G0005','02'),('G0003','06'),('G0002','07'),('G0006', '08'),
                ('G0007','01'),('G0006','01'),('G0005','01'),('G0004','01'),('G0009','01'),('G0003','01'),('G0002','01'),
                ('G0001','01'),('G0001','02'),('G0001','03'),('G0001','04'),('G0001','05'),('G0001','06'),('G0001','07'),('G0001','08'),('G0001','09'),
                ('G0001', '13'),('G0010','11');
                GO
                INSERT INTO PermissionGroupUser 
                VALUES 
                ('G0001','A001'),
                ('G0001','A002'),
                ('G0001','A003'),
                ('G0001', 'A021'),
                ('G0001', 'A022'),
                ('G0001', 'A023'),
                ('G0002','A001'),
                ('G0002','A002'),
                ('G0002','A003'),
                ('G0003','A004'),
                ('G0003','A005'),
                ('G0005','A006'),
                ('G0005','A007'),
                ('G0005','A008'),
                ('G0006','A009'),
                ('G0006','A010'),
                ('G0008','A011'),
                ('G0008','A012'),
                ('G0008','A013'),
                ('G0008','A014'),
                ('G0009','A015'),
                ('G0009','A016'),
                ('G0009','A017'),
                ('G0009','A018'),
                ('G0009','A019'),
                ('G0009','A020'),
                ('G0010','A001'),
                ('G0010','A002'),
                ('G0010','A003'),
                ('G0010','A007'),
                ('G0010','A008'),
                ('G0010','A009'),
                ('G0010','A012'),
                ('G0010','A013'),
                ('G0010','A019'),
                ('G0009', 'A021'),
                ('G0009', 'A023');
                GO
                INSERT INTO Form (FormId, UserId, Date, CategoryId, ProjectId, DepartmentId, Content, ExpectedFinishedDay, Tel, ProcessNodeId, FormIsActive, ManDay, CreatedTime, UpdatedTime) VALUES
                ('F00001', 'A001', '2024-08-01', 'C1', 'P001', 'D001', 'Hello', '2024-08-05', '1234', 'PN000002', 1, 5, '2024-08-01','2024-08-01'),
                ('F00002', 'A002', '2024-08-01', 'C1', 'P001', 'D002', 'Hello', '2024-08-05', '1234', 'PN000009', 1, 5, '2024-08-01','2024-08-01'),
                ('F00003', 'A003', '2024-08-01', 'C1', 'P001', 'D003', 'Hello', '2024-08-05', '1234', 'PN000015', 1, 5, '2024-08-01','2024-08-01'),
                ('F00004', 'A004', '2024-08-01', 'C1', 'P001', 'D001', 'Hello', '2024-08-05', '1234', 'PN000027', 1, 5, '2024-08-01','2024-08-01')
                GO
                INSERT INTO ProcessNode(ProcessNodeId, UserActivityId, UserId, DepartmentId, CreatedTime, UpdatedTime, FormId) VALUES
                ('PN000001'        ,'01',        'A001','D002'        ,'2024-08-01', '2024-08-01', 'F00001'),
                ('PN000002'        ,'02',        'A005','D002'        ,'2024-08-02', '2024-08-02', 'F00001'),
                ('PN000003'        ,'03',        'A006','D002'        ,'2024-08-03', '2024-08-03', 'F00001'),
                ('PN000004'        ,'06',        'A007','D001'        ,'2024-08-01', '2024-08-01', 'F00001'),
                ('PN000005'        ,'07',        'A008','D001'        ,'2024-08-02', '2024-08-02', 'F00001'),
                ('PN000006'        ,'08',        'A009','D001'        ,'2024-08-03', '2024-08-03', 'F00001'),
                ('PN000007'        ,'09',        'A001','D002'        ,'2024-08-03', '2024-08-03', 'F00001'),
                ('PN000008'        ,'01',        'A002','D002'        ,'2024-08-01', '2024-08-01', 'F00002'),
                ('PN000009'        ,'02',        'A005','D002'        ,'2024-08-02', '2024-08-02', 'F00002'),
                ('PN000010'        ,'03',        'A006','D002'        ,'2024-08-03', '2024-08-03', 'F00002'),
                ('PN000011'        ,'06',        'A007','D001'        ,'2024-08-01', '2024-08-01', 'F00002'),
                ('PN000012'        ,'07',        'A008','D001'        ,'2024-08-02', '2024-08-02', 'F00002'),
                ('PN000013'        ,'08',        'A009','D001'        ,'2024-08-03', '2024-08-03', 'F00002'),
                ('PN000014'        ,'09',        'A002','D002'        ,'2024-08-03', '2024-08-03', 'F00002'),
                ('PN000015'        ,'01',        'A003','D002'        ,'2024-08-01', '2024-08-01', 'F00003'),
                ('PN000016'        ,'02',        'A005','D002'        ,'2024-08-02', '2024-08-02', 'F00003'),
                ('PN000017'        ,'03',        'A006','D002'        ,'2024-08-03', '2024-08-03', 'F00003'),
                ('PN000018'        ,'06',        'A007','D001'        ,'2024-08-01', '2024-08-01', 'F00003'),
                ('PN000019'        ,'07',        'A008','D001'        ,'2024-08-02', '2024-08-02', 'F00003'),
                ('PN000020'        ,'08',        'A009','D001'        ,'2024-08-03', '2024-08-03', 'F00003'),
                ('PN000021'        ,'09',        'A003','D002'        ,'2024-08-03', '2024-08-03', 'F00003'),
                ('PN000022'        ,'01',        'A004','D002'        ,'2024-08-01', '2024-08-01', 'F00004'),
                ('PN000023'        ,'02',        'A005','D002'        ,'2024-08-02', '2024-08-02', 'F00004'),
                ('PN000024'        ,'03',        'A006','D002'        ,'2024-08-03', '2024-08-03', 'F00004'),
                ('PN000025'        ,'06',        'A007','D001'        ,'2024-08-01', '2024-08-01', 'F00004'),
                ('PN000026'        ,'07',        'A008','D001'        ,'2024-08-02', '2024-08-02', 'F00004'),
                ('PN000027'        ,'08',        'A009','D001'        ,'2024-08-03', '2024-08-03', 'F00004'),
                ('PN000030'        ,'09',        'A004','D002'        ,'2024-08-03', '2024-08-03', 'F00004');
                GO
                insert into FormRecord(ProcessingRecordId,Remark,FormId,DepartmentId,UserId,ResultId,UserActivityId,Date,GradeId,CreatedTime,UpdatedTime)
                values('PR00000001','null','F00001','D001','A001','RS4','01','2024-08-01','01','2024-08-01','2024-08-01'),
                             ('PR00000002','good','F00001','D001','A002','RS1','02','2024-08-01','02','2024-08-01','2024-08-01'),
                             ('PR00000003','edit form','F00001','D001','A001','RS4','01','2024-08-01','01','2024-08-01','2024-08-01'),
                             ('PR00000004','edit form','F00001','D001','A002','RS2','02','2024-08-01','02','2024-08-01','2024-08-01');
                insert into MeetingRooms values
                ('R001','5','2024-09-19','2024-09-19'),
                ('R002','8','2024-09-19','2024-09-19'),
                ('R003','10','2024-09-19','2024-09-19'),
                ('R004','6','2024-09-19','2024-09-19'),
                ('R005','5','2024-09-19','2024-09-19'),
                ('R006','20','2024-09-19','2024-09-19');
                insert into Meeting values
                ('mt002','R001','2024-09-28 02:00','2024-09-28 03:00',N'資訊部月會','2024-09-20','2024-09-20','A001'),
                ('mt003','R002','2024-09-29 04:00','2024-09-29 05:00',N'人資部月會','2024-09-20','2024-09-20','A002'),
                ('mt004','R003','2024-09-28 03:00','2024-09-28 06:00',N'行銷部月會','2024-09-20','2024-09-20','A003'),
                ('mt005','R004','2024-09-27 02:00','2024-09-27 03:00',N'財會部月會','2024-09-20','2024-09-20','A004'),
                ('mt006','R005','2024-09-25 07:00','2024-09-25 12:00',N'採購部月會','2024-09-20','2024-09-20','A005'),
                ('mt007','R006','2024-09-25 08:00','2024-09-25 09:00',N'商品部月會','2024-09-20','2024-09-20','A006');
            ");

        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
